/* eslint-disable vue/no-parsing-error */
<template>
  <div class="container px-4 mx-auto">
    <div
      class="
        relative
        flex flex-col
        w-full
        min-w-0
        mb-6
        -mt-64
        break-words
        bg-white
        rounded-lg
        shadow-xl
      "
    >
      <div class="px-6">
        <div class="mt-6 text-center">
          <h3
            class="mb-2 text-4xl font-semibold leading-normal text-blueGray-700"
          >
            เกี่ยวกับเรา
          </h3>
          <p class="font-semibold leading-normal text-md text-blueGray-500">
            About Us
          </p>
        </div>

        <div class="py-6 mt-10 border-t border-blueGray-200">
          <div class="flex flex-wrap justify-center">
            <div class="w-full px-4 lg:w-12/12">
              <ul class="flex flex-row flex-wrap pt-3 pb-4 mb-0 list-none">
                <li class="flex-auto mr-2 -mb-px text-center last:mr-0">
                  <a
                    class="
                      block
                      px-5
                      py-3
                      font-bold
                      leading-normal
                      uppercase
                      rounded
                      shadow-lg
                    "
                    v-on:click="toggleTabs(1)"
                    v-bind:class="{
                      'text-emerald-500 bg-white': openTab !== 1,
                      'text-white bg-emerald-500': openTab === 1,
                    }"
                  >
                    <i class="mr-1 text-base fas fa-history"></i>
                    ประวัติความเป็นมา
                  </a>
                </li>
                <li
                  v-for="about in about_arr"
                  :key="about.AboutId"
                  class="flex-auto mr-2 -mb-px text-center last:mr-0"
                >
                  <a
                    class="
                      block
                      px-5
                      py-3
                      font-bold
                      leading-normal
                      uppercase
                      rounded
                      shadow-lg
                    "
                    @click="toggleTabs(about.AboutId)"
                    v-bind:class="{
                      'text-emerald-500 bg-white': openTab !== about.AboutId,
                      'text-white bg-emerald-500': openTab === about.AboutId,
                    }"
                  >
                    <i class="mr-1 text-base fas fa-bullseye"></i>
                    {{ about.Topic }}
                  </a>
                </li>
                <li class="flex-auto mr-2 -mb-px text-center last:mr-0">
                  <a
                    class="
                      block
                      px-5
                      py-3
                      font-bold
                      leading-normal
                      uppercase
                      rounded
                      shadow-lg
                    "
                    v-on:click="toggleTabs(10)"
                    v-bind:class="{
                      'text-emerald-500 bg-white': openTab !== 10,
                      'text-white bg-emerald-500': openTab === 10,
                    }"
                  >
                    <i class="mr-1 text-base fas fa-history"></i>
                    ผลการเรียนรู้ PLO หลักสูตร
                  </a>
                </li>
              </ul>

              <div class="relative flex flex-col w-full">
                <div class="flex-auto px-0 py-5">
                  <div
                    class="text-justify tab-content tab-space text-blueGray-700"
                  >
                    <div
                      v-bind:class="{
                        hidden: openTab !== 1,
                        block: openTab === 1,
                      }"
                    >
                      <p
                        class="
                          mt-8
                          text-2xl
                          font-bold
                          leading-relaxed
                          text-center
                        "
                      >
                        ประวัติสาขาวิชาวิทยาการคอมพิวเตอร์
                      </p>
                      <p
                        class="
                          mb-8
                          text-xl
                          font-bold
                          leading-relaxed
                          text-center
                        "
                      >
                        คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้
                      </p>
                      <p class="my-6 rem2">
                        สาขาวิชาวิทยาการคอมพิวเตอร์
                        ได้ดำเนินการเปิดสอนมาตั้งแต่ปีการศึกษา2536
                        เป็นสาขาวิชาแรกของคณะวิทยาศาสตร์ที่เริ่มจัดตั้งมาพร้อมกับคณะวิทยาศาสตร์
                        โดยมีประวัติความเป็นมาดังนี้
                      </p>
                      <img
                        class="py-2 w-1/2 center-img shadow-md border"
                        src="@/assets/img/his2.jpg"
                        alt=""
                      />
                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2536 </b>หมวดวิชาวิทยาศาสตร์และคณิตศาสตร์
                        ภาควิชาศึกษาทั่วไป คณะธุรกิจการเกษตร
                        ได้แยกตัวออกมาเพื่อจัดตั้งเป็นคณะวิทยาศาสตร์
                        โดยมีภาควิชาวิทยาการคอมพิวเตอร์เป็นภาควิชาหนึ่งที่สังกัดในคณะวิทยาศาสตร์
                        ในระยะเริ่มแรกได้บริหารจัดการโดย หัวหน้าภาควิชาคนแรก
                        (รองศาสตราจารย์จรัส กาใหญ่)
                        ต่อมาได้ขยายจำนวนรับคณาจารย์มากขึ้นตามลำดับ
                        โดยมีภาระงานสอนรายวิชาคอมพิวเตอร์เบื้องต้น
                        ซึ่งเป็นรายวิชาพื้นฐานสำหรับนักศึกษาในหลายสาขาวิชา
                        นอกจากนั้นยังเปิดสอนรายวิชาการเขียนโปรแกรมภาษาเบสิค
                        และรายวิชาโปรแกรมสำเร็จรูปเพื่อเป็นวิชาเลือกให้กับนักศึกษาที่สนใจเรียนรายวิชาทางด้านคอมพิวเตอร์เป็นวิชาเลือกเสรีอีกด้วย
                        ขณะนั้นใช้เครื่องไมโครคอมพิวเตอร์รุ่น 386 จำนวน 30
                        เครื่อง เป็นอุปกรณ์ที่ใช้ในการเรียนการสอน
                        โดยสำนักงานของภาควิชาวิทยาการคอมพิวเตอร์ตั้งอยู่ที่อาคารเรียนรวมทางวิทยาศาสตร์
                        (หลังเก่า) 2 ชั้น
                      </p>
                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2538 </b
                        >ภาควิชาวิทยาการคอมพิวเตอร์ได้เปิดสอนหลักสูตรสาขาวิชาวิทยาการคอมพิวเตอร์ขึ้น
                        เป็นสาขาวิชาแรกในคณะวิทยาศาสตร์
                        โดยมีนักศึกษาเข้าศึกษาเป็นรุ่นแรกจำนวน 38 คน
                        พร้อมกับได้รับงบประมาณจัดซื้อเครื่องไมโครคอมพิวเตอร์คอมพิวเตอร์รุ่น486
                        เพิ่มอีกจำนวน 30 เครื่อง
                        ต่อจากนั้นในแต่ละปีการศึกษาก็รับนักศึกษาเข้าใหม่อีกปีละประมาณ
                        50 คน
                      </p>

                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2543 </b>
                        สาขาวิชาวิทยาการคอมพิวเตอร์ มีจำนวนนักศึกษาทั้ง 4
                        ชั้นปีประมาณ 200 คน
                        และมีนักศึกษาที่สำเร็จการศึกษาจบตามหลักสูตร
                        ออกไปรับใช้ประเทศชาติแล้วจำนวน 2 รุ่น ประมาณ 65 คน
                        ขณะนั้นภาควิชาวิทยาการคอมพิวเตอร์ได้ย้ายสำนักงานมาอยู่ที่อาคารเรียนรวมทางวิทยาศาสตร์
                        (หลังใหม่) ชั้นที่ 6
                        โดยมีห้องปฏิบัติการคอมพิวเตอร์เบื้องต้นสำหรับนักศึกษาสาขาวิชาอื่น
                        ๆ เพิ่มอีกจำนวน 2 ห้องปฏิบัติการ โดยติดตั้งระบบ LAN
                        ที่ใช้เครื่องไมโครคอมพิวเตอร์ Pentium III 500 MHz
                        ใช้ระบบปฏิบัติการ WINDOWS 98 จำนวน 50 เครื่อง
                        ห้องปฏิบัติการคอมพิวเตอร์สำหรับนักศึกษาสาขาวิชาวิทยาการคอมพิวเตอร์
                        จำนวน 2 ห้อง โดยติดตั้งระบบ LAN
                        ที่ใช้เครื่องไมโครคอมพิวเตอร์ Pentium III 500 MHz
                        ระบบปฏิบัติการ WINDOWS NT จำนวน 100 เครื่อง
                        ห้องปฏิบัติการคอมพิวเตอร์ระบบ UNIX
                        สำหรับงานวิจัยของคณาจารย์และงานสำหรับทำโครงงาน
                        คอมพิวเตอร์ของนักศึกษาสาขาวิชาวิทยาการคอมพิวเตอร์ชั้นปีที่
                        4 ประกอบด้วยไมโครคอมพิวเตอร์ SUN จำนวน 5 เครื่อง
                        เครื่องไมโครคอมพิวเตอร์ Silicon Graphic จำนวน 2 เครื่อง
                        และเครื่องไมโครคอมพิวเตอร์ Pentium III 500 MHz จำนวน 3
                        เครื่อง
                      </p>
                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2545 </b>
                        ภาควิชาวิทยาการคอมพิวเตอร์
                        เริ่มเปิดการเรียนการสอนหลักสูตรสาขาวิชาที่ 2 คือ
                        หลักสูตรสาขาวิชาเทคโนโลยีสารสนเทศ
                        สังกัดภาควิชาวิทยาการคอมพิวเตอร์ มีนักศึกษาภาคปกติ
                        จำนวนประมาณ 55 คนและภาคสมทบ จำนวนประมาณ 90 คน ปีการศึกษา
                        2547 ภาควิชาวิทยาการคอมพิวเตอร์
                        ได้เพิ่มจำนวนห้องเรียนปฏิบัติการคอมพิวเตอร์ จำนวน 1
                        ห้องเรียน และห้องบรรยายคอมพิวเตอร์จำนวน 1 ห้องเรียน
                        สำหรับใช้ในการเรียนการสอนของสาขาวิชาเทคโนโลยีสารสนเทศ
                        โดยตั้งอยู่ที่อาคารเรียนรวมทางวิทยาศาสตร์ (หลังเก่า) 2
                        ชั้น และจัดซื้อเครื่องไมโครคอมพิวเตอร์ Intel รุ่น
                        Pentium 4 ความเร็วขนาด 3.0 GHz จำนวน 20 เครื่อง
                      </p>
                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2549 </b>ภาควิชาวิทยาการคอมพิวเตอร์
                        รับอาจารย์มาเพิ่มจำนวน 2 คน
                        และมีอาจารย์ที่ได้รับทุนการศึกษากลับมาปฏิบัติงานจำนวน 2
                        คน
                        เพื่อรองรับรายวิชาของสาขาวิชาวิทยาการคอมพิวเตอร์และสาขาวิชาเทคโนโลยีสารสนเทศที่มีจำนวนรายวิชาเพิ่มมากขึ้น
                      </p>
                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2550 </b>ภาควิชาวิทยาการคอมพิวเตอร์
                        มีจำนวนนักศึกษาทั้ง 2 สาขาวิชา รวมทั้งหมด
                        (ภาคปกติและภาคสมทบ) ประมาณ 433 คน คณาจารย์ 18 คน
                        (รวมทั้งนักเรียนทุนโท-เอกและอาจารย์ ลาศึกษาต่อ)
                      </p>
                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2551 </b>ภาควิชาวิทยาการคอมพิวเตอร์
                        ยกเลิกภาควิชาเปลี่ยนแปลงเป็น สาขาวิชาวิทยาการคอมพิวเตอร์
                        แยกตัวออกจากสาขาวิชาเทคโนโลยีสารสนเทศ
                      </p>
                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2554 </b>สาขาวิชาวิทยาการคอมพิวเตอร์
                        รับสมัครพนักงานมหาวิทยาลัยตำแหน่งอาจารย์วุฒิการศึกษาระดับปริญญาโท
                        จำนวน 1 อัตรา
                      </p>
                      <p class="my-6 rem2">
                        <b>ปีการศึกษา 2555 </b>สาขาวิชาวิทยาการคอมพิวเตอร์
                        มีห้องปฏิบัติการคอมพิวเตอร์ใหม่เพิ่มอีก จำนวน 1 ห้อง คือ
                        ห้องปฏิบัติการคอมพิวเตอร์ 3203 ชั้น 2 อาคารจุฬาภรณ์
                        โดยได้จัดซื้อเครื่องไมโครคอมพิวเตอร์ Intel รุ่น Core i7
                        จำนวน 46 เครื่อง และมีห้องสำหรับวิจัยทางคอมพิวเตอร์ คือ
                        ห้อง 3204 ชั้น 2 อาคารจุฬาภรณ์
                        และได้มีการบรรจุพนักงานมหาวิทยาลัยตำแหน่งอาจารย์ระดับปริญญาเอก
                        จำนวน 1 คน สาขาวิชาได้มีโลโก้ของสาขาวิชาฯ
                        โดยเป็นผลงานการออกแบบของนักศึกษาและทางสาขาวิชาฯได้ปรับปรุงสีให้เหมาะสมโดยใช้สีฟ้าเข้มเป็นสัญลักษณ์ของสาขาวิชาฯ
                        สาขาวิชาวิทยาการคอมพิวเตอร์ มีจำนวนนักศึกษาที่กำลังศึกษา
                        รวมทั้งหมดประมาณ 472 คน คณาจารย์ 14 คน
                        (รวมทั้งนักเรียนทุนโท-เอกและอาจารย์ลาศึกษาต่อ)
                      </p>
                    </div>

                    <div
                      v-for="about in about_arr"
                      :key="about.AboutId"
                      v-bind:class="{
                        hidden: openTab !== about.AboutId,
                        block: openTab === about.AboutId,
                      }"
                    >
                      <p
                        class="
                          mt-8
                          text-2xl
                          font-bold
                          leading-relaxed
                          text-center
                        "
                      >
                        {{ about.Topic }}สาขาวิชาวิทยาการคอมพิวเตอร์
                      </p>
                      <p
                        class="
                          mb-8
                          text-xl
                          font-bold
                          leading-relaxed
                          text-center
                        "
                      >
                        คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้
                      </p>
                      <p class="my-6 rem2 text-justify">
                        {{ about.Detail.replace("PLO", "\r") }}
                      </p>
                    </div>

                    <div
                      class="cssanimation sequence fadeInBottom"
                      v-bind:class="{
                        hidden: openTab !== 10,
                        block: openTab === 10,
                      }"
                    >
                      <p
                        class="
                          mt-8
                          text-2xl
                          font-bold
                          leading-relaxed
                          text-center
                        "
                      >
                        ผลการเรียนรู้ PLO หลักสูตรสาขาวิชาวิทยาการคอมพิวเตอร์
                      </p>
                      <p
                        class="
                          mb-8
                          text-xl
                          font-bold
                          leading-relaxed
                          text-center
                        "
                      >
                        คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้
                      </p>
                      <p class="my-6 rem2 font-semibold">
                        ผลลัพธ์การเรียนรู้ที่เฉพาะเจาะจง (Specific Learning
                        Outcomes: SLO)
                      </p>

                      <p class="my-6 px-4">
                        <b>PLO 1</b> : มีความรู้
                        ความสามารถทั้งภาคทฤษฎีและภาคปฏิบัติทางวิชาการและเป็นนักปฏิบัติที่เชี่ยวชาญทางด้านวิทยาการคอมพิวเตอร์
                      </p>
                      <p class="my-6 px-4">
                        <b>PLO 2</b> : มีทักษะในการแสวงหาความรู้โดยอิสระ
                        และนำไปประยุกต์ใช้งานทางด้านวิทยาการคอมพิวเตอร์
                        ได้อย่างถูกต้องและมีประสิทธิภาพ
                      </p>
                      <p class="my-6 px-4">
                        <b>PLO 3</b> :
                        มีทักษะที่สามารถนำไปใช้ในการประกอบอาชีพทั้งภาครัฐ เอกชน
                        และเป็นนักเทคโนโลยี ที่สามารถเป็นผู้ประกอบการในอนาคตได้
                      </p>
                      <p class="my-6 px-4">
                        <b>PLO 4</b> : มีความสามารถในเชิงสหวิทยาการทั้งการคิด
                        วิเคราะห์และแก้ไขปัญหาอย่างเป็นระบบ
                        เพื่อสร้างผลงานวิจัยและนวัตกรรมที่มีคุณภาพ
                        โดยมุ่งเน้นด้านการเกษตรหรือเทคโนโลยีในศตวรรษที่ 21
                        ทางด้านวิชาวิทยาการคอมพิวเตอร์ ผลลัพธ์การเรียนรู้ทั่วไป
                        (Generic Learning Outcomes) ของหลักสูตร
                      </p>
                      <p class="my-6 px-4">
                        <b>PLO 5</b> : มีความเป็นผู้นำ
                        กล้าคิดตัดสินใจโดยใช้เกณฑ์หรือมาตรฐาน
                        รู้จักบทบาทและหน้าที่ของตนเองในสังคม
                      </p>
                      <p class="my-6 px-4">
                        <b>PLO 6</b> : มีวินัย เคารพกฎเกณฑ์ขององค์กรและสังคม
                        มีสามารถในการใช้ภาษา
                        อีกทั้งสามารถบูรณาการความรู้ที่เพิ่มศักยภาพและขีดสมรรถนะของชุมชน
                      </p>
                      <p class="my-6 px-4">
                        <b>PLO 7</b> : มีคุณธรรม จริยธรรม ศีลธรรมในการครองชีพ
                        และมีจรรยาบรรณในวิชาชีพ
                      </p>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
import http from "@/services/WebpageService";
export default {
  data() {
    return {
      about_arr: [],
      openTab: 0,
      obj: [],
    };
  },
  components: {},
  methods: {
    toggleTabs: function (tabNumber) {
      this.openTab = tabNumber;
    },
    async getAbout() {
      let response = await http.get(`about`);
      this.about_arr = response.data;
    },
    changeId() {
      this.openTab = this.$store.state.aboutid;
    },
  },
  mounted() {
    this.getAbout();
    this.changeId();
  },
};
</script>
